# Brewfile for core development tools and dependencies

# Core utilities
brew "bat"                     # Cat clone with syntax highlighting
brew "eza"                     # Modern ls replacement
brew "neovim"                  # Hyperextensible Vim-based text editor
brew "tmux"                    # Terminal multiplexer
brew "zoxide"                  # Smarter cd command
brew "yazi"                    # Terminal file manager
brew "fd"                      # Simple, fast, user-friendly alternative to 'find'
brew "ripgrep"                 # Line-oriented search tool
brew "jq"                      # Command-line JSON processor
brew "imagemagick"             # Image processing tools
brew "git-delta"               # Syntax-highlighting pager for git and diff output
brew "tlrc"                    # Tool for managing and running tmux layouts
brew "ffmpeg"                  # Multimedia framework for handling video, audio, and other multimedia files
brew "sevenzip"                # File archiver with a high compression ratio
brew "poppler"                 # PDF rendering library
brew "node"                    # JavaScript runtime built on Chrome's V8 engine
brew "lazygit"                 # Simple terminal UI for git commands

# Shell enhancements
brew "powerlevel10k"           # Zsh theme
brew "zsh-autosuggestions"     # Fish-like autosuggestions
brew "zsh-syntax-highlighting" # Syntax highlighting for Zsh

# Node version management
brew "nvm"                     # Node Version Manager

# Fuzzy finder
brew "fzf"                     # Command-line fuzzy finder

# Terminal emulator (install via cask)
cask "wezterm"                 # GPU-accelerated terminal emulator

# Fonts
tap "homebrew/cask-fonts"      # Homebrew fonts tap
cask "font-meslo-lg-nerd-font" # Meslo LG Nerd Font
cask "font-symbols-only-nerd-font" # Symbols Only Nerd Font

